# PipingSlope Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..PipingSlope Property
SpecTypeId Class See Also
---
Slope, in discipline Piping.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId PipingSlope { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PipingSlope As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PipingSlope {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace